Twist/Twist-TAS/servicerequestfiles/ResetVoicemailPassword.xml

<soapenv:Envelope xmlns:com="http://www.tracfone.com/CommonTypes" xmlns:phon="http://www.tracfone.com/PhoneCommonTypes" xmlns:res="http://b2b.tracfone.com/ResetVoicemailPasswordService" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-82F132FC14114C64E814768249598001">
            <wsse:Username>@secusername</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">@secpassword</wsse:Password>          
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <res:ResetVoicemailPasswordRequest>
         <com:requestToken>
            <com:clientTransactionId>11111</com:clientTransactionId>
            <com:clientId>1111</com:clientId>
         </com:requestToken>
         <com:brandName>@brand</com:brandName>
         <com:sourceSystem>WEB</com:sourceSystem>
         <com:language>ENG</com:language>
         <res:device>
            <phon:min>@min</phon:min>
            <phon:esn>@esn</phon:esn>
         </res:device>
      </res:ResetVoicemailPasswordRequest>
   </soapenv:Body>
</soapenv:Envelope>
